function main
    disp('********************************************************************')
    number = input('输入需要测试题号：\n1：2.2    2：2.3   3：2.4   0：退出\n测试过程请勿关闭图像浏览窗口\n');
    while (number ~= 0)
        if (number == 1)
            Task_1;
        elseif (number == 2)
            Task_2;
        elseif (number == 3)
            Task_3;
        else
            disp('错误输入');
        end
        disp('********************************************************************')
        number = input('输入需要测试题号：\n1：2.2    2：2.3   3：2.4   0：退出\n测试过程请勿关闭图像浏览窗口\n');
    end
    

end

